Repository: Nahom4258/sb_mobile
Catalog: lib/l10n/app_*.arb
Languages: am, or

# greeting
source: Hello {username}
am: ሰላም {username}
or: Akkam {username}

# start_text
source: Continue your journey!
am: ጉዞዎን ይቀጥሉ!
or: Dubbisa kee itti fufi!

source: Daily Streak
am: ዕለታዊ እንቅስቃሴ
or: Shaakala Guyyaa Guyyaa

# daily_streak_info
source: Your consecutive Daily Streak signifies the number of days you've actively engaged with the app
am: የእርስዎ ተከታታይ ዕለታዊ እንቅስቃሴ ከመተግበሪያው ጋር ንቁ ተሳትፎ ያደረጉትን የቀኖች ብዛት ያመለክታል
or: Shaakali Guyyaa Guyyaa kee guyyoota aplikeeshinii itti fayyadamte agarsiisa.

# first_lesson
source: Take your first lesson
am: የመጀመሪያውን ትምህርትዎን ይውሰዱ
or: Barnoota kee jalqabaa fudhu!

# first_lesson_text
source: Begin your journey!
am: ጉዞህን ጀምር!
or: Dubbisa kee jalqabi!

source: Daily Quiz
am: ዕለታዊ ጥያቄዎች
or: Qormaata Guyyaa

# daily_quiz_text
source: Complete daily quiz to earn points
am: ነጥቦችን ለማግኘት ዕለታዊ ጥያቄዎችን ይስሩ
or: Qabxi argachuuf qormaata guyyaa xumurii.

# daily_quiz_info
source: Answer 7-10 curated questions daily, spanning various subjects. Earn points and respond before the day ends for additional rewards
am: ከተለያዩ የትምህርት ዓይነቶች በየቀኑ የተዋቀሩ ከ 7 እስከ 10 ጥያቄዎችን ይመልሱ። ነጥቦችን ያግኙ እና ቀኑ ከማለቁ በፊት ለተጨማሪ ሽልማቶች ምላሽ ይስጡ።
or: Gaaffilee mata dureewan gara garaarraa qophaa'anii fi 7-10 irra hin caalle guyya guyyaan hojjachuun qabxi argadhu.

source: Go
am: ሂድ
or: Jalqabi

source: Continue Studying
am: ማጥናት ቀጥል
or: Barnoota itti fufi

# continue_key
source: Continue
am: ቀጥል
or: Itti fufi

source: Daily Quest
am: ዕለታዊ ተልዕኮ
or: Qorannoo Guyyaa Guyyaa

# daily_quest_info
source: Accomplish various tasks across the app and accumulate points. Once tasks are completed, view them as marked off your quest list
am: በመተግበሪያው ላይ የተለያዩ ተግባሮችን ያከናውኑ እና ነጥቦችን ያከማቹ። አንዴ ተግባራት ከተጠናቀቁ በኋላ ከተልዕኮ ዝርዝርዎ ላይ ምልክት እንደተደረገባቸው ይመልከቱ
or: Qabxi argachuuf qorannoowan armaan gaditti cuqafamaan xumuri.

source: Completed
am: ተጠናቋል
or: Xumurame

source: Contests
am: ውድድሮች
or: Dorgommiiwan

# contest_info
source: A live event where students register and compete to earn actual prizes. It consists of national exam questions from different subjects.
am: ተማሪዎች ትክክለኛ ሽልማቶችን ለማግኘት የሚመዘገቡበት እና የሚወዳደሩበት የቀጥታ ዝግጅት። ከተለያዩ የትምህርት ዓይነቶች የብሔራዊ ፈተና ጥያቄዎችን ያቀፈ ነው።
or: Dorgomin guyya guyya ykn torbee sagantaa barattoonni gaaffi adda addaa deebisuun irratti badhaafamani dha. Dorgommiiwan kun gaaffilee qormaata biyyoolessaa mata dureewwan gara garaarraa dhufan kan qabatani dha.

# no_contest
source: Registration Opens Soon!
am: ምዝገባ በቅርቡ ይከፈታል!
or: Galmeen yeroo muraasaan eegala!

# no_contest_text
source: Stay tuned for more details and be prepared to join the excitement. Come back soon for registration!
am: ለተጨማሪ ዝርዝሮች ይቆዩ እና ደስታውን ለመቀላቀል ይዘጋጁ። ለመመዝገብ በቅርቡ ይመለሱ!
or: Dorgomii itti aanuuf galmaa'udhaaf yeroo muraasa booda debi'aa!

source: Register
am: ይመዝገቡ
or: Galmaa'i

source: Upcoming
am: መጪ
or: Dhufaa jiru

source: Hours
am: ሰዓታት
or: Sa'aatii

source: Minutes
am: ደቂቃዎች
or: Daqiiqaa

source: Seconds
am: ሰከንዶች
or: Sekendii

source: Registered
am: ተመዝግበዋል
or: Galmoofteta

source: Go to Contest
am: ወደ ውድድር ሂድ
or: Dorgommiiwan Bani

source: Live
am: ቀጥታ
or: Jalqabeera

source: Previous Contests
am: ቀዳሚ ውድድሮች
or: Dorgommiiwan Darban

source: All Contests
am: ሁሉም ውድድሮች
or: Dorgommiiwan Hunda

# my_contests
source: My Contest
am: የእኔ ውድድር
or: Dorgommiiwan Koo

source: Start
am: ጀምር
or: Jalqabi

source: Time Spent
am: ጊዜ አሳልፈዋል
or: Yeroo Sitti Fudhate

source: Points
am: ነጥቦች
or: Qabxii

source: Rank
am: ደረጃ
or: Sadarkaa

source: Weekly Prizes
am: ሳምንታዊ ሽልማቶች
or: Badhaasa Torbanii

# first
source: 1st Place
am: 1ኛ ቦታ
or: Sadarkaa 1ffaa

# second
source: 2nd Place
am: 2ኛ ቦታ
or: Sadarkaa 2ffaa

# third
source: 3rd Place
am: 3ኛ ደረጃ
or: Sadarkaa 3ffaa

source: Questions
am: ጥያቄዎች
or: Gaaffilee

source: Lessons
am: ትምህርቶች
or: Darsiiwwan

source: Ranking
am: ደረጃ
or: Sadarkaa

source: Question
am: ጥያቄ
or: Gaaffii

source: Explanation
am: ማብራሪያ
or: Xiinxala

source: Contest Analysis
am: የውድድር ትንተና
or: Xiinxala Dorgommii

# current_question
source: Question {current} OF {total}
am: ጥያቄ {current} ከ {total}
or: Gaaffii {current} IRRAA {total}

source: Skip
am: ዝለል
or: Darbi

source: Skip to
am: ዝለል
or: Irraa darbii

# jump_to_question
source: Jump to Questions
am: ወደ ጥያቄዎች ዝለል
or: Gaaffi irraa darbii

# skip_detail
source: Make sure to answer every question
am: ለእያንዳንዱ ጥያቄ መልስ መስጠትዎን ያረጋግጡ
or: Gaaffii hunda deebisuu mirkaneessi

source: RELATED TOPIC
am: ተዛማጅ ርዕስ
or: Mata Duree Wal-Qabate

source: Explore
am: ያስሱ
or: Qorannoo

source: My Courses
am: የእኔ ኮርሶች
or: koorsiiwwan koo

# lesson
source: Lessons
am: ትምህርት
or: Barnoota

source: Bookmarks
am: ዕልባቶች

source: Chapters
am: ምዕራፎች
or: Boqonnaawwan

source: Old
am: አሮጌ
or: Kan Dura

# new_key
source: New
am: አዲስ
or: Haaraa

source: Empty
am: ባዶ
or: Duwwaa

# no_bookmark
source: No Bookmarked items
am: ምንም ዕልባት የተደረገባቸው ክፍሎች የሉም

source: Search Course
am: ኮርስ ፈልግ
or: Koorsii Barbaadii

source: Find Course
am: ኮርስ ያግኙ
or: Koorsii Barbaadi

source: Quizzes
am: ጥያቄዎች

source: Progress
am: እድገት
or: Adeemsa

# chapter_name
source: Chapter {number}
am: ምዕራፍ {number}
or: Boqonnaa {number}

# subtopic_completed
source: {number} subtopics completed
am: {number} ንዑስ ርዕሶች ተጠናቋል
or: {number} Mata Duree Xiqqaa Xumurame

# section
source: Section {current}/{total}
am: ክፍል {current}/{total}
or: Kutaa {current}/{total}

source: Next
am: ቀጣይ
or: Itti Aanu

source: Prev
am: ቀዳሚ
or: Dursa

source: Finish
am: ጨርስ
or: xumuri

source: Incorrect
am: ስህተት
or: Dogoggoraa

source: Correct
am: ትክክል
or: Sirrii

source: Keep practicing!
am: መለማመዱን ይቀጥሉ!
or: Shaakala Itti Fufi!

# keep_practicing_text
source: You need to work harder to improve your score.
am: ነጥብዎን ለማሻሻል ጠንክሮ መሥራት ያስፈልግዎታል።
or: Qabxii kee fooyyessuuf cimtee hojjechuu qabda.

source: Go back
am: ተመለስ
or: Deebi'i

source: New Quiz
am: አዲስ ፈተና

source: No quizzes
am: ምንም ፈተናዎች የሉም

# create_quiz_text
source: Let's create questions based on your preference
am: በምርጫዎ መሰረት ጥያቄዎችን እንፍጠር
or: Filannoo kee irratti hundaa'uun gaaffii/quizii haa uumnu

source: Quiz Title
am: የፈተና ጥያቄ ርዕስ

source: Number of Questions
am: የጥያቄዎች ብዛት
or: Baay'ina Gaaffii

source: Preferred Chapters
am: የተመረጡ ምዕራፎች
or: Boqonnaa Filatamaa

source: Start Quiz
am: ፈተናን ጀምር

source: Exam mode
am: የፈተና ሁኔታ
or: Haala Qormaata

source: Learning mode
am: የመማሪያ ሁነታ
or: Haala Barachuu

# learning_mode_text
source: See the answer as soon as you select a choice
am: አንድ ምርጫ እንደመረጡ መልሱን ይመልከቱ
or: Akkuma filannoo filatteen deebii isaa ilaali

source: Quiz mode
am: የፈተና ሁነታ

# quiz_mode_text
source: See the answer after completing the exam.
am: ፈተናውን ከጨረሱ በኋላ መልሱን ይመልከቱ.
or: Qormaata erga xumurtee booda deebii ilaali.

source: Quit
am: አቁም
or: Dhiisuu

source: Submit
am: አስገባ
or: Galchii

source: Analysis
am: ትንተና
or: Xiinxala

source: Resume
am: ከቆመበት ቀጥል
or: Itti Fufi

source: Mock Exams
am: የሞዴል ፈተናዎች
or: Qormaata Fakkeessaa

# previous_year_exams
source: Previous Years Exams
am: ያለፈው ዓመት ፈተናዎች
or: Qormaata Bara Dara

# previous_year_exams_text
source: Practice real exams collected previous years.
am: ካለፉት ዓመታት የተሰበሰቡ እውነተኛ ፈተናዎችን ይለማመዱ።
or: Qormaata biyyoolessa waggoota darban walitti qabame shaakali.

source: AI-Generated Exams
am: በAI-የተፈጠሩ ፈተናዎች
or: Qormaata aayin maddisiifame

# ai_generated_exams_text
source: Exam created using AI based on real exams.
am: በእውነተኛ ፈተናዎች ላይ በመመስረት AI በመጠቀም የተፈጠረ ፈተና።
or: Qormaata qormaata biyyoolessa irratti hundaa'uun aayin uumame.

source: My Exams
am: የእኔ ፈተናዎች
or: Qormaata koo

# my_exams_text
source: Exams you have took and currently ongoing exams.
am: የወሰዷቸው ፈተናዎች እና አሁን በመካሄድ ላይ ያሉ ፈተናዎች።
or: Qormaata fudhattee fi ammaa itti fufee jiru.

source: Select Subject
am: ርዕሰ ጉዳይ ይምረጡ
or: Gosa Barnoota Filadhu

source: Biology
am: ባዮሎጂ
or: Baayoloojii

source: Chemistry
am: ኬሚስትሪ
or: Keemistirii

source: Physics
am: ፊዚክስ
or: Fiiziksii

source: English
am: እንግሊዝኛ
or: Afaan Ingilizii

source: Civics
am: ስነዜጋ
or: Lammummaa

source: Mathematics
am: ሒሳብ
or: Herrega

# satr
source: S
am: ቅ

source: COIN
am: ሳንቲም

source: students
am: ተማሪዎች

source: Economics
am: ኢኮኖሚክስ
or: Diinagdee

source: History
am: ታሪክ
or: Seenaa

source: Geography
am: ጂኦግራፊ
or: Ji’ograafii

source: University Entrance Exams
am: የዩኒቨርሲቲ መግቢያ ፈተናዎች
or: Qormaata Seensa Yuunivarsiitii

source: Leaderboard
am: የመሪዎች ሰሌዳ
or: Gabatee Hooggansaa

source: Contest
am: ውድድር
or: Dorgommii

source: Courses
am: ኮርሶች
or: koorsiiwwan

source: Home
am: መነሻ ገጽ

source: Exams
am: ፈተናዎች
or: Qormaatawwan

# new_course
source: Start a Course
am: አዲስ ኮርስ
or: Koorsii Haaraa

# video
source: Videos
am: ቪዲዮ
or: Viidiyoowwan

source: Downloads
am: የወረዱ

source: Try Contest
am: ውድድሩን ይሞክሩ
or: Dorgommii yaalii

source: Ok
am: እሺ
or: Tole

source: You have registered to the contest successfully.
am: ወደ ውድድሩ በተሳካ ሁኔታ ተመዝግበዋል።
or: Dorgommii kanaaf milkaa'inaan galmoofteta.

source: Register Now
am: አሁኑ ይመዝገቡ
or: Amma Galmaa'ii

source: Choose your subject
am: የትምህርት አይነት ይምረጡ
or: Gosa barnoota kee filadhu

source: Check your internet connection and try again.
am: ኢንተርኔትዎን ያረጋግጡ እና ደግመው ይሞከሩ
or: Interneetii kee ilaalii irra deebi'ii yaalii.

source: SkillBridge weekly contest
am: SkillBridge ሳምንታዊ ውድድር
or: Dorgommii torban torbaniin SkillBridge

source: The contest is live.
am: ውድድሩ በቀጥታ ነው።
or: Dorgommiin kun kallattiin darbaa jira.

source: Contest has ended!
am: ውድድሩ አልቋል!
or: Dorgommiin xumurameera!

source: You have submitted for this category successfully!
am: ለዚህ ምድብ በተሳካ ሁኔታ አስገብተሃል!
or: Ramaddii kanaaf milkaa'inaan galchiteta!

source: pts
am: ነጥቦች
or: Qabxiilee

source: sec
am: ሰከንድ
or: sekondii

source: day
am: ቀን
or: guyyaa

source: hr
am: ሰዓት
or: sa'aatii

source: min
am: ደቂቃ
or: daqiiqaa

source: Completed successfully!
am: በተሳካ ሁኔታ ተጠናቋል።
or: Milkaa'inaan xumuramera!

source: Thank you for your feedback
am: ለአስትያየትዎት እናመሰግናለን
or: Yaada nu kenniteef galatoomaa

source: Something is not right
am: የሆነ ነገር ትክክል አይደለም
or: Wanti tokko sirrii miti

source: Coming Soon! No contests here yet.
am: በቅርብ ቀን! እስካሁን እዚህ ምንም ውድድር የለም።
or: Yeroo dhiyootti! Dorgommiin asitti hanga ammaatti hin jiru.

# you_have_not_registered_for_any_contests_yet
source: You haven't registered for any contests yet.
am: ለማንኛውም ውድድር እስካሁን አልተመዘገቡም።
or: Dorgommii kamiifuu hanga ammaatti hin galmoofne.

source: Select subject you want to study.
am: ለማጥናት የሚፈልጉትን ትምህርት ይምረጡ።
or: Gosa barnoota qayyabachuu feetuu filadhu.

source: Lesson Completed
am: ትምህርቱ ተጠናቀቀ
or: Barumsi Xumurame

source: Congratulations!
am: እንኳን ደስ አላችሁ!
or: Baga Gammadde!

source: You have just completed your first lesson
am: የመጀመሪያ ትምህርቶን ጨርሰዋል
or: Barumsi kee isa jalqabaa reefuu xumurteetta

source: No content available
am: ምንም ይዘት አይገኝም
or: Qabiyyeen hin jiruu

source: Unknown Error happened
am: ያልታወቀ ስህተት ተከስቷል።
or: Dogoggorri Hin Beekamne uumame

source: Grade
am: ክፍል
or: Kutaa

source: CHAPTER
am: ምዕራፍ
or: BOQONNAA

source: videos available
am: የሚገኙ ቪዲዮዎች
or: viidiyoowwan

source: National Exam Questions
am: የብሔራዊ ፈተና ጥያቄዎች
or: Gaaffileei Qormaata Biyyaalessaa

source: Start New Course
am: አዲስ ኮርስ ይጀምሩ
or: Koorsii Haaraa Jalqabi

source: prepare by taking exams
am: የAI የተፈጠሩ ፈተናዎን በመውሰድ ይዘጋጁ
or: qormaata fudhachuun qophaa’ii

# section_key
source: Section
am: ክፍል
or: Kutaa

source: Create new password
am: አዲስ የይለፍ ቃል ይፍጠሩ
or: Jecha icciitii haaraa uumuu

source: Set a secure password for your account. Ensure both entries match before submitting
am: ለመለያዎ ደህንነቱ የተጠበቀ የይለፍ ቃል ያዘጋጁ። ከማቅረቡ በፊት ሁለቱም ግቤቶች እንደሚዛመዱ ያረጋግጡ
or: Akkaawuntii keetiif jecha icciitii gaarii kaa'i. Erga galchitee booda lamaan isaaniitu walfakkaachuu isaanii mirkaneessi.

source: Password
am: የይለፍ ቃል
or: Jecha icciitii

source: Enter your password
am: የይለፍ ቃልዎን ያስገቡ
or: Jecha icciitii kee galchi

source: Confirm Password
am: የይለፍ ቃል አረጋግጥ
or: Jecha icciitii mirkaneessi

source: Reset Password
am: የይለፍ ቃል ዳግም አስጀምር
or: Jecha icciitii deebisi

# setting_up_your_learning_path
source: Getting Things Ready for You...
am: ነገሮችን ለእርስዎ በማዘጋጀት ላይ...
or: Daandii barumsaa kee qopheessuu

source: Are you ready for your first lesson?
am: ለመጀመሪያው ትምህርትዎ ዝግጁ ነዎት?
or: Barnoota kee isa jalqabaatiif qophoofteettaa?

# let_us_start_learning
source: Let's start learning!
am: መማር እንጀምር!
or: Baruu haa jalqabnu!

source: Start Learning
am: መማር ጀምር
or: Barachuu Jalqabi

source: Not Now
am: አሁን አይሆንም
or: Amma Miti

source: Enter the email or phone number associated with your account and we will send an OTP code so that you can reset your password
am: ከመለያዎ ጋር የተገናኘውን ኢሜል ወይም ስልክ ቁጥር ያስገቡ እና የይለፍ ቃልዎን እንደገና ለማስጀመር የኦቲፒ ኮድ እንልካለን።
or: Imeelii ykn lakkoofsa bilbilaa akkaawuntii kee waliin walqabatu galchii jecha icciitii kee akka deebitee saaguu dandeessuu koodii OTP ergina

source: Email or Phone number
am: ኢሜል ወይም ስልክ ቁጥር
or: Email ykn lakkoofsa bilbilaa

source: Enter your email or phone number
am: ኢሜልዎን ወይም ስልክ ቁጥርዎን ያስገቡ
or: Email ykn lakkoofsa bilbilaa kee galchii

source: Send Code
am: ኮድ ላክ
or: Koodii ergi

source: Hi, Welcome Back!
am: ሰላም እንኳን ደህና መጡ!
or: Hi, Baga Nagaan Dhufte!

source: Forgot Password
am: የይለፍ ቃል ረስቻለሁ
or: Jecha Darbii Dagatte

source: Login
am: ይግቡ
or: Seensa

# sign_in_with_google
source: Continue with Google
am: በGoogle ይግቡ
or: Seensa Google waliin galchi

# do_not_have_an_account
source: Don't have an account?
am: መለያ የሎትም?
or: Akkaawuntii hin qabdu?

source: Sign Up
am: ይመዝገቡ
or: Galmaa'aa

source: New password confirmed successfully
am: አዲስ የይለፍ ቃል በተሳካ ሁኔታ ተረጋግጧል
or: Jechi icciitii haaraan milkaa'inaan mirkanaa'eera

source: You have successfully confirm your new password. Please, use your new password when logging in.
am: አዲሱን የይለፍ ቃልዎን በተሳካ ሁኔታ አረጋግጠዋል። እባክዎ ሲገቡ አዲሱን የይለፍ ቃልዎን ይጠቀሙ።
or: Jecha icciitii haaraa kee milkaa'inaan mirkaneessiteetta. Maaloo, yeroo seentan jecha icciitii haaraa keessan fayyadamaa.

source: Okay
am: እሺ
or: Tole

source: Welcome to SkillBridge
am: እንኳን ወደ SkillBridge በደህና መጡ
or: Gara SkillBridgetti baga nagaan dhufte

source: Discover a comprehensive exam preparation tool that helps you ace your Ethiopian university entrance exams
am: የኢትዮጵያ የዩንቨርስቲ መግቢያ ፈተናዎችዎን ለመጨረስ የሚረዳዎትን አጠቃላይ የፈተና ዝግጅት መሳሪያ ያግኙ

source: Personalized Quizzes
am: ለግል የተበጁ ጥያቄዎች

source: Tailor your study experience with personalized quizzes
am: የጥናት ልምድዎን ከግል ጥያቄዎች ጋር ያብጁ
or: Muuxannoo qo’annoo keessanii gaaffiiwwan dhuunfaa ta’aniin mijeessi

source: Model Exams for Success
am: ለስኬት ሞዴል ፈተናዎች
or: Qormaata Moodeela Milkaa'inaaf

source: Access to a collection of previous year exams with their explanations
am: ያለፈው ዓመት ፈተናዎች ስብስብ ከማብራሪያቸው ጋር መድረስ።
or: Qormaata bara darbee walitti qabame ibsa isaanii waliin argachuu

source: Already have an account?
am: መለያ አሎት?
or: Duraanis akkaawuntii qabduu?

source: OTP code has been sent to your email successfully...
am: የኦቲፒ ኮድ በተሳካ ሁኔታ ወደ ኢሜልዎ ተልኳል….
or: Koodiin OTP gara email keessaniitti ergame milkaa'inaan...

source: sign up failed...
am: ምዝገባው አልተሳካም....
or: mallattoon hin milkoofne....

source: What Department Are You Studying?
am: የትኛውን ክፍል ነው የምታጠናው?
or: Kutaa Maal Barachaa Jirta?

source: What Is Your Major Or Field Of Study?
am: የእርስዎ ዋና ወይም የጥናት መስክ ምንድን ነው?
or: Muummee Ykn Dirreen Qo'annoo Keessan Maali?

source: Receive relevant materials for university exit exam preparation.
am: ለዩኒቨርሲቲ መልቀቂያ ፈተና ዝግጅት አስፈላጊ ቁሳቁሶችን ይቀበሉ።
or: Qophii qormaata ba’uu yuunivarsiitiitif meeshaalee barbaachisoo ta’an argachuu.

source: What Exam Are You Preparing For?
am: ለየትኛው ፈተና እያዘጋጁ ነው?
or: Qormaata Maaliif Qophaa'aa Jirta?

# let_us_setup_the_learning_environment_based_on_you_exam_type
source: Let's setup the learning environment based on you exam type
am: በእርስዎ የፈተና አይነት መሰረት የመማሪያ አካባቢን እናዋቅር
or: Mee naannoo barumsaa gosa qormaata kee irratti hundaa'uun haa setup goonu

# let_us_get_started
source: Let's get started!
am: እንጀምር!
or: Mee haa jalqabnu!

source: Full Name
am: ሙሉ ስም
or: Maqaa Guutuu

source: Enter your full name
am: ሙሉ ስሞትን ያስገቡ
or: Maqaa kee guutuu galchi

# sign_up_with_Google
source: Continue with Google
am: በGoogle ይመዝገቡ
or: Google waliin itti fufaa

source: Verification code
am: የማረጋገጫ የሚስጥር ቁጥር
or: Koodii mirkaneessuu

source: We have sent a verification code to your phone number
am: የማረጋገጫ ኮድ ወደ ስልኮት ቁጥር ልከናል።
or: Lakkoofsa bilbila keessaniif koodii mirkaneessaa erginee jirra

source: Send again
am: ድጋሜ ይላክ
or: Ammas ergaa

source: Email is required
am: ኢሜል ያስፈልጋል
or: Email barbaachisa

source: Invalid email format
am: ልክ ያልሆነ የኢሜይል ቅርጸት
or: Akkaataa iimeelii sirrii hin taane

source: Phone number is required
am: ስልክ ቁጥር ያስፈልጋል
or: Lakkoofsi bilbilaa barbaachisa

source: Invalid phone number format
am: ልክ ያልሆነ የስልክ ቁጥር ቅርጸት
or: Akkaataa lakkoofsa bilbilaa sirrii hin taane

source: Enter a valid email or phone number
am: ትክክል የሆነ ኢሜይል ወይም ስልክ ቁጥር ያስገቡ
or: Imeelii ykn lakkoofsa bilbilaa sirrii ta’e galchi

source: Full name is required
am: ሙሉ ስም ያስፈልጋል
or: Maqaa guutuu barbaachisa

source: Enter both first and last name
am: ሁለቱንም የመጀመሪያ እና የአያት ስም ያስገቡ
or: Maqaa jalqabaa fi maqaa dhumaa lamaan galchi

source: Password is required
am: የይለፍ ቃል ያስፈልጋል
or: Password barbaachisa

source: Password must be at least 6 characters long
am: የይለፍ ቃል ቢያንስ 6 ቁምፊዎች መሆን አለበት።
or: Jechi icciitii yoo xiqqaate arfii 6 dheerachuu qaba

source: Passwords do not match
am: የይለፍ ቃሎች ተመሳሳይ አይደሉም
or: Jechoonni icciitii wal hin simne

source: Please enter a title
am: ርዕስ ያስገቡ
or: Mee mata duree galchaa

source: Please enter number of questions
am: እባክዎ የጥያቄዎች ብዛት ያስገቡ
or: Mee lakkoofsa gaaffii galchaa

source: Quiz questions should be more than 0
am: የፈተና ጥያቄዎች ከ0 በላይ መሆን አለባቸው
or: Gaaffiin quiz 0 ol ta'uu qaba

source: Invalid input. Please enter a valid integer.
am: ልክ ያልሆነ ግቤት እባክዎ ትክክለኛ ቁጥር ያስገቡ።
or: Galtee sirrii hin taane. Mee lakkoofsa guutuu sirrii galchi.

source: DONE
am: ተከናውኗል
or: RAAWWATAME

source: SUBMITTED
am: ገብቷል
or: DHIYAATEE

# submit_bold
source: SUBMIT
am: አስገባ
or: GALCHUU

# of_text
source: OF
am: ከ
or: KAN

source: Place
am: ቦታ
or: Iddoo

source: Bookmarked Question
am: ዕልባት የተደረገበት ጥያቄ
or: Gaaffii Bookmarked

source: Bookmarked Item
am: ዕልባት የተደረገበት ንጥል
or: Meeshaa Bookmarked ta'e

source: Do you want to flag this as inappropriate?
am: ይህን አግባብ አይደለም ብለው መጠቆም ይፈልጋሉ?
or: Kana akka waan hin malleetti alaabaa itti kaa'uu barbaadduu?

source: please mention other reason
am: እባክዎን ሌላ ምክንያት ይጥቀሱ
or: mee sababa biraa kaasaa

source: Inaccurate
am: ትክክል ያልሆነ
or: Sirrii miti

source: Out of Scope
am: ከአድማስ ውጭ
or: Daangaa Daangaa Alaa

source: Too wide
am: በጣም ሰፊ
or: Garmalee bal'aa

source: No Answers
am: መልሶች የሉም
or: Deebii Hin Qabu

source: Unrelated choice
am: ያልተዛመደ ምርጫ
or: Filannoo wal hin qabanne

source: Wrong Answer
am: የተሳሳተ ምላሽ
or: Deebii Dogoggoraa

source: Irrelevant
am: ግንኙነት የለውም
or: Barbaachisaa hin qabu

source: Wrong Explanation
am: የተሳሳተ ማብራሪያ
or: Ibsa Dogoggoraa

source: Other
am: ሌላ
or: Kan biraa

# mon
source: M
am: ሰ

# tue
source: T
am: ማ

# wed
source: W
am: ረ

# thu
source: T
am: ሐ

# fri
source: F
am: ዓ

# sun
source: S
am: እ

source: Today
am: ዛሬ
or: Har'a

source: Score
am: ነጥብ
or: Qabxii

source: Time Expired
am: ጊዜው አልቋል።
or: Yeroon Darbe

source: You have run out of time to answer the question.
am: ጥያቄውን ለመመለስ ጊዜ አልቆቦታል።
or: Yeroon gaaffii deebisuuf si jalaa dhume.

source: Confirmation Required
am: ማረጋገጫ ያስፈልጋል
or: Mirkaneessuun Barbaachisa

source: Are you sure you want to leave? Your unsaved changes may be lost.
am: እርግጠኛ ኖት መውጣት ይፈልጋሉ? ያልተቀመጡ ለውጦችዎ ሊጠፉ ይችላሉ።
or: Bahuu akka barbaaddu mirkaneeffatteettaa? Jijjiiramni kee hin qusatamne baduu danda'a.

source: Daily Quiz Analysis
am: ዕለታዊ ጥያቄዎች ትንተና
or: Xiinxala Quiz Guyyaa Guyyaa

source: No quiz for the day. Check back tomorrow for a new challenge!
am: ለቀኑ ምንም ጥያቄ የለም። ለአዲስ ፈተና ነገ ተመልሰው ይመልከቱ!
or: Guyyaa sanaaf quiz hin jiru. Qormaata haaraa argachuuf boru deebi'aa ilaalaa!

source: you are not connected
am: ኢንተርኔት የሎትም
or: walitti hidhamiinsa hin qabdu

source: Continue Learning
am: መማርዎን ይቀጥሉ
or: Barnoota Itti Fufa

source: Browse from existing categories
am: ከነባር ምድቦች ያስሱ
or: Ramaddiiwwan jiran irraa daawwadhu

source: SEE ALL
am: ሁሉንም ይዩ
or: HUNDA ILAALI

source: Are you ready for exam?
am: ለፈተና ዝግጁ ኖት?
or: Qormaataaf qophooftaniittuu?

source: You have no Recommended Mocks
am: ምንም የሚመከር ሞክ የለዎትም።
or: Recommended Mocks hin qabdu

source: National exam
am: ብሔራዊ ፈተና
or: Qormaata biyyoolessaa

source: Recommended Model Exams
am: የሚመከሩ የሞዴል ፈተናዎች
or: Qormaata Moodeela Gorfamu

source: Error Loading
am: በመጫን ላይ ስህተት
or: Dogoggora Fe'amuu

source: Time left till your exam
am: ፈተናዎ ሊደርስ የቀረው ጊዜ
or: Yeroon hanga qormaata keessaniitti hafe

# let_us_begin_your_journey
source: Let's begin your journey!
am: ጉዞዎን እንጀምር!
or: Mee imala keessan haa jalqabnu!

source: Hey
am: ሰላም
or: Akkam

source: Hello
am: ሰላም
or: Akkam

source: Cancel
am: መሰረዝ
or: Haquu

source: Take Your First Lesson
am: የመጀመሪያውን ትምህርትዎን ይውሰዱ
or: Barumsa Kee Jalqabaa Fudhadhu

source: Begin your journey!
am: ጉዞህን ጀምር!
or: Imala kee jalqabi!

source: Months
am: ወራት
or: Ji'oota

source: Month
am: ወር
or: Ji'a

source: Weeks
am: ሳምንታት
or: Torban

source: Week
am: ሳምንት
or: Torbee

source: Days
am: ቀናት
or: Guyyoota

source: You are currently offline. Would you like to view your downloaded content?
am: በአሁኑ ጊዜ ኦፍላይን ነህ። ያወረድከውን ይዘት መመልከት ትፈልጋለህ?
or: Yeroo ammaa kana sarara ala jirta. Qabiyyee buufatte ilaaluu barbaadduu?

source: View Courses
am: የትምህርት ኮርሶች
or: Koorsii Ilaali

source: View Exams
am: የሞዴል ፈተናዎች
or: Qormaata Ilaali

source: Downloaded Exams
am: የወረዱ ፈተናዎች
or: Qormaata Downloaded

source: Downloaded Courses
am: የወረዱ ትምህርቶች
or: Koorsii Buufaman

source: Get access to downloaded exams
am: የወረዱ ፈተናዎች ያግኙ
or: Qormaata buufame argachuuf carraa argadhaa

source: No downloaded exams found.
am: ምንም የወረዱ ፈተናዎች አልተገኙም
or: Qormaanni buufame hin argamne.

source: No downloaded courses found.
am: ምንም የወረዱ ኮርሶች አልተገኙም
or: Koorsii buufame hin argamne.

source: All Time
am: ሁልጊዜ
or: Yeroo Hundaa

source: Weekly
am: ሳምንታዊ
or: Torban torbaniin

source: Monthly
am: ወርሃዊ
or: Ji'a ji'aan

source: retry
am: እንደገና ይሞክሩ
or: irra deebi'ii yaali

source: First Name
am: ስም
or: Maqaa jalqabaa

source: Last Name
am: የአባት ስም
or: Maqaa akaakayyuu

source: First name is required
am: ስም ያስፈልጋል
or: Maqaa jalqabaa barbaachisa

source: Last name is required
am: የአባት ስም ያስፈልጋል
or: Maqaan dhumaa barbaachisaadha

# gamified_learning_experience_with_competitive_weekly_contest_and_custom_quizzes
source: Gamified learning experience with competitive weekly contests, and custom quizzes
am: አዝናኝ እና አስተማሪ የሆነ ሳምንታዊ ውድድሮች እና የጥናት ልምድ ከግል ጥያቄዎች ጋር ያብጁ
or: Muuxannoo barumsaa gamified dorgommii torban torbaniin dorgoman, fi gaaffiiwwan amala

source: Gamified Learning Experience
am: አዝናኝ የመማር ልምድ
or: Muuxannoo Barnootaa Gamified

source: Enter your first name
am: ስሞትን ያስገቡ
or: Maqaa kee isa jalqabaa galchi

source: Enter your last name
am: የአባትዎን ስም ያስገቡ
or: Maqaa dhumaa kee galchi

# daily_quest_info_revised
source: Complete your daily tasks to collect points. Each finished task will be checked off your quest list.
am: ነጥቦችን ለመሰብሰብ የዕለት ተዕለት ተግባሮችህን አሟላ። እያንዳንዱ የተጠናቀቀ ስራ ዝርዝር ይመልከቱ።
or: Qabxii walitti qabuuf hojii guyyaa guyyaa kee xumuri. Tokkoon tokkoon hojii xumurame tarree barbaacha kee irraa ni mallatteeffama.

# daily_quiz_info_revised
source: Collect points by answering 7 to 10 curated questions daily, from various subjects.
am: በየዕለቱ ከተለያዩ ትምህርቶች የተወጣጡ ከ7 እስከ 10 ለሚሆኑ ጥያቄዎች መልስ በመስጠት ነጥቦቹን አሰባስቡ።
or: Guyyaatti gaaffilee qophaa’an 7 hanga 10, dhimmoota adda addaa irraa deebisuun qabxii walitti qabaa.

# enter_analysis_mode
source: Get analysis for your daily quiz
am: የእርስዎን ዕለታዊ ጥያቄዎች ማብራሪያ ያግኙ።
or: Xiinxala gaaffii guyyaa guyyaa keessaniif argadhaa

# pick_up_from_where_you_left_off
source: Pick up where you left off!
am: ካቆሙበት ይቀጥሉ!
or: Bakka itti dhiifte ka'i!

source: Course Downloaded Successfully
am: ኮርሱ በተሳካ ሁኔታ ወርዷል
or: Koorsii Milkaa'inaan Buufameera

source: Downloaded
am: የወረደ
or: Buufameera
