Repository: Nahom4258/sb_mobile
Catalog: lib/l10n/app_*.arb
Languages: am, or

source: Download
am: አውርድ
or: Buusuu

source: Ask
am: ጠይቅ
or: Gaafachuu

source: Friends
am: ጏደኞች
or: Hiriyoota

source: Friend
am: ጏደኛ
or: Hiriyaa

source: Requests
am: ጥያቄዎች
or: Gaaffii

source: Sent
am: የተላኩ
or: Erge

source: Received
am: የተቀበልካቸው
or: Fudhatame

source: Withdraw
am: ኣስወግድ
or: Gidduutti dhaabuu

source: Accept
am: ተቀበል
or: Simachuu

source: Decline
am: ኣትቀበል
or: Gadi bu'uu

source: Add new friends
am: ኣዲስ ጏደኛ ፍጠር
or: Hiriyyoota haaraa itti dabali

# frend_suggestions
source: Friend suggestions
am: የጓደኛ ጥቆማዎች
or: Yaada hiriyyaa

source: Name
am: ስም
or: Maqaa

# gread
source: Grade {grade}
am: {grade} ኛ ክፍል
or: Maqaa {grade}

source: Add friend
am: ጓደኛ ጨምር
or: Hiriyaa itti dabali

# streak_cap
source: STREAK
am: ዥረት

# points_cap
source: POINTS
am: ነጥቦች

# rank_cap
source: RANK
am: ደረጃ

# coins_cap
source: COINS
am: ሳንቲሞች

source: Overview
am: አጠቃላይ እይታ
or: Haala Waliigalaa

source: Chapters Completed
am: የተጠናቀቁ ምዕራፎች
or: Boqonnaawwan Xumuraman

# poins
source: points
am: ነጥቦች
or: qabxiilee

source: Topics Completed
am: የተጠናቀቁ ርዕሶች
or: Mata dureewwan Xumuraman

source: Questions Solved
am: የተጠናቀቁ ጥያቄዎች
or: Gaaffilee Furmaata

source: Consistency Chart
am: የወጥነት ገበታ
or: Chaartii Walsimannaa

source: School
am: ትምህርት ቤት
or: Mana barumsaa

source: Edit Profile
am: ፕሮፋይሎን ያስተካክሉ
or: Profaayilii Gulaali

source: Stream
am: ስትሪም
or: Yaa'uu

source: Invite Friends
am: ጏደኛዎን ይጋብዙ
or: Hiriyoota Afeeraa

# select_language
source: Please select your language.
am: ቋንቋ ይምረጡ
or: Afaan kee filadhu.

source: Change Language
am: ቋንቋ መቀየር
or: Afaan Jijjiiri

source: No live contest available
am: ምንም የቀጥታ ውድድር የለም፣ እባክዎን ለውድድር ይመዝገቡ
or: Dorgommiin kallattii hin jiru

source: No custom contest available
am: ምንም ውድድር አልተገኘም
or: Dorgommiin aadaa hin jiru

source: No custom contest invitations available
am: ምንም ብጁ የውድድር ግብዣዎች የሉም
or: Waamichi dorgommii aadaa hin jiru

source: Custom Contests
am: ብጁ ውድድሮች
or: Dorgommiiwwan Aadaa

source: Create contests and invite friends
am: ውድድሮችን ይፍጠሩ እና ጓደኞችን ይጋብዙ
or: Dorgommii uumuu fi hiriyoota afeeruu

source: Ongoing
am: በሂደት ላይ
or: Itti fufee jira

source: Invitations
am: ግብዣዎች
or: Waamicha

source: Create
am: ፍጠር
or: Uumuu

source: Edit
am: ማረም
or: Gulaaluu

source: Create your own contest and compete with your friends.
am: የራስዎን ውድድር ይፍጠሩ እና ከጓደኞችዎ ጋር ይወዳደሩ
or: Dorgommii mataa keetii uumiitii hiriyoota kee waliin dorgomi.

source: Contest Name
am: የውድድር ስም
or: Maqaa Dorgommii

source: Contest Description
am: የውድድር መግለጫ
or: Ibsa Dorgommii

# start_date_and_time
source: Start Date & Time:
am: የመጀመሪያ ቀን እና ሰዓት:
or: Guyyaa fi Sa'aatii Jalqabaa:

# end_date_and_time
source: End Date & Time:
am: የመጨረሻ ቀን እና ሰዓት:
or: Guyyaa & Yeroo Xumuraa:

# select_start_date_and_time
source: Select Start Date & Time:
am: የመጀመሪያ ቀን እና ሰዓት ይምረጡ:
or: Guyyaa fi Sa'aatii Jalqabaa filadhu:

# select_end_date_and_time
source: Select End Date & Time:
am: የመጨረሻ ቀን እና ሰዓት ይምረጡ:
or: Guyyaa fi Sa'aatii Xumuraa filadhu:

source: No questions added yet
am: እስካሁን ምንም ጥያቄዎች አልተጨመሩም።
or: Gaaffiin hanga ammaatti hin dabalamne

source: Add Questions
am: ጥያቄዎችን ያክሉ
or: Gaaffii Dabalaa

source: Both start and end dates must be selected.
am: ሁለቱም የመጀመሪያ እና የመጨረሻ ቀናት መመረጥ አለባቸው
or: Guyyaan jalqabaa fi xumuraa lamaan filatamuu qabu.

source: Start date-time must be before end date-time.
am: የመነሻ ቀን-ሰዓት ከማለቁ ቀን-ሰዓት በፊት መሆን አለበት።
or: Guyyaa-sa'aatiin jalqabaa guyyaa-sa'aatii xumuraa dura ta'uu qaba.

source: End date-time must be after start date-time.
am: የማብቂያ ቀን-ሰዓት ከመጀመሪያው ቀን-ሰዓት በኋላ መሆን አለበት።
or: Guyyaa-yeroo xumuraa guyyaa-yeroo jalqabaa booda ta'uu qaba.

source: Dates must be in the future.
am: ቀኖች ወደፊት መሆን አለባቸው።
or: Guyyoonni gara fuulduraatti ta'uu qabu.

source: Start date-time must be in the future.
am: የመነሻ ቀን-ሰዓት ወደፊት መሆን አለበት።
or: Guyyaa-yeroo jalqabaa gara fuulduraatti ta'uu qaba.

source: End date-time must be in the future.
am: የማብቂያ ቀን-ሰዓት ወደፊት መሆን አለበት።
or: Guyyaa-yeroo xumuraa gara fuulduraatti ta'uu qaba.

source: Invalid Date-Time
am: ልክ ያልሆነ ቀን-ሰዓት
or: Guyyaa-Yeroo Sirrii Hin Taane

source: Please enter contest name
am: እባክዎ የውድድር ስም ያስገቡ
or: Mee maqaa dorgommii galchaa

source: Please enter contest description
am: እባክዎ የውድድር መግለጫ ያስገቡ
or: Mee ibsa dorgommii galchaa

source: Edit Contest
am: ውድድር አርትዕ
or: Dorgommii Gulaaluu

source: Delete Contest
am: ውድድሩን ሰርዝ
or: Dorgommii Haquu

source: Registered Friends
am: የተመዘገቡ ጓደኞች
or: Hiriyyoota Galmaa'an

# you_have_reached_the_limit
source: You have reached your limit please wait for 10min
am: ለ 10 ደቂቃዎች የመጠበቅ ገደብ ላይ ደርሰዋል
or: Daangaa keessan geesseetta mee 10min eegaa

# first_name_min_length
source: First name must be at least 3 characters.
am: የመጀመሪያ ስም ቢያንስ 3 ፊደል መሆን አለበት።
or: Maqaan jalqabaa arfiilee 3 gadi hin ta'u.

# last_name_min_length
source: Last name must be at least 3 characters.
am: የመጨረሻ ስም ቢያንስ 3 ፊደል መሆን አለበት።
or: Maqaan dhumaa arfiilee 3 gadi hin ta'u.

source: Grade 9
am: 9ኛ ክፍል
or: Kutaa 9

source: Grade 10
am: 10ኛ ክፍል
or: Kutaa 10

source: Grade 11
am: 11ኛ ክፍል
or: Kutaa 11

source: Grade 12
am: 12ኛ ክፍል
or: Kutaa 12

# which_grade_are_you
source: ðŸ‘‹ Hi, tell us about yourself, which grade are you?
am: 👋 ሰላም፣ ራስህን አስተዋውቀን፣ ስንተኛ ክፍል ነህ?
or: 👋 Akkam, of beeksisi, kutaan kee kami?

# which_stream_are_you
source: Which stream are you studying?
am: የትኛውን ስርዓት ትምህርት ትማራለህ?
or: Gosa barnoota kam keessatti barachaa jirtaa?

source: Natural Science
am: ተፈጥሮ ሳይንስ
or: Saayinsii Uumamaa

source: Social Science
am: ማህበራዊ ሳይንስ
or: Saayinsii Hawaasummaa

# select_school_you_go_to
source: Which school do you go to?
am: የሚማሩበትን ትምህርት ቤት ይምረጡ.
or: Mana barnoota kamitti deemtaa?

source: High School
am: ከፍተኛ ትምህርት ቤት
or: Mana Barumsaa Olaanaa

# select_school
source: Select your school
am: የሚማሩበትን ትምህርት ቤት ይምረጡ
or: Mana barnoota kee filadhu

source: Region
am: ክልል
or: Naannoo

source: Select your region
am: ክልልዎን ይምረጡ
or: Naannoo kee filadhu

source: Select your gender
am: ፆታዎን ይምረጡ
or: Sanyii kee filadhu

source: Male
am: ወንድ
or: Dhiira

source: Female
am: ሴት
or: Dubartii

source: Gender
am: ፆታ
or: Sanyii

# are_there_specific_subjects_you_find_more_challenging
source: Which subjects do you find challenging?
am: በተለይ አስቸጋሪ የሆኑ ትምህርቶችን ይምረጡ.
or: Barnoota sirratti ulfaataa ta'an kamtu jira?

# continue_button
source: Continue
am: ዪቀጥሉ
or: Itti fufi

source: Amharic
am: አማርኛ
or: Afaan Amaaraa

# oromifa
source: Afaan oromoo
am: ኦሮምኛ

source: Let's start
am: እንጀምር
or: Haa jalqabnu

source: Both
am: ሁለቱም
or: Lamaan

# both_description
source: If you are in grade 9 or 10, please select 'Both' to get subjects from both Natural and Social Sciences.
am: 9 ወይም 10ኛ ክፍል ከሆኑ፣ ሁለቱም የተፈጥሮ እና ማህበራዊ ሳይንሶች ትምህርቶችን ለመቀበል እባክዎ 'ሁለቱም'ን ይምረጡ።
or: Kutaa 9 ykn 10 keessatti yoo jirtu, mata dureewwan Saayinsii Uumamaa fi Hawaasummaa irraa argachuuf 'Lamaan' filadhu.

source: Settings
am: ቅንብሮች
or: Sajoo

source: General
am: አጠቃላይ
or: Guutuu

source: Privacy
am: ግላዊነት
or: Daangaa

source: Terms and Conditions
am: ውሎች እና ሁኔታዎች
or: Shirkii fi Haala

# see_terms_and_conditions
source: See SkillBridge's terms and conditions
am: የ SkillBridgeን ውሎች እና ሁኔታዎች ይመልከቱ
or: Shirkii fi haala SkillBridge ilaali

source: Privacy Policy
am: የግላዊነት ፖሊሲ
or: Sirna Daangaa

# see_privacy_policy
source: See SkillBridge's privacy policy
am: የ SkillBridgeን የግላዊነት ፖሊሲ ይመልከቱ
or: Sirna Daangaa SkillBridge ilaali

source: Log out
am: ውጣ
or: Galaana Ba'uu

# log_out_confirmation
source: Do you want to logout?
am: መውጣት ትፈልጋለህ?
or: Ba'uu barbaadduu?

# log_out_pop_up_confirmation
source: Are you sure you want to logout?
am: እርግጠኛ ነህ መውጣት ትፈልጋለህ?
or: Galaana keessaa bahuuf mirkaneeffadhaa?

# filter
source: Filter By
am: አጣራ በ
or: Filadhu

source: Start Exam
am: ፈተናውን ጀምር
or: Qormaata Jalqabi

# mock_anlysis
source: Mock Analysis
am: ሞክ ትንተና
or: Xiinxala Mock

source: Retake Exam
am: እንደገና ይፈተኑ
or: Qormaata Irra Deebi'i

# mock_downloaded_succesfully
source: Mock Downloaded Successfully
am: ሞክ በተሳካ ሁኔታ ወርዷል
or: Mock milkaa'inaan buufameera

# top_score
source: Top scores
am: ከፍተኛ ውጤቶች
or: Qabxii Ol'aanaa

source: Number of correct answers
am: ትክክለኛ መልሶች ብዛት
or: Deebii sirrii ta'an lakkoofsa

source: Your rank among students
am: በተማሪዎች መካከል ያለዎት ደረጃ
or: Sadarkaa kee barattoota keessaa

# chat_intro_message
source: Hi there, I am Professor LearnAlot, How can I help you today?
am: ሰላም፣ እኔ ፕሮፌሰር LearnAlot ነኝ፣ ዛሬ እንዴት ልረዳህ እችላለሁ?
or: Akkam, An Profeesar LaanAloot, Maal si gargaaruu danda'a har'a?

# ai_assistant_bot
source: AI Assitant Bot
am: AI ረዳት Bot
or: Itti Aanaa AI

source: Share SkillBridge
am: SkillBridgeን አጋራ
or: SkillBridge Qoodii

# share_this_qr_code_to_your_friends
source: Share this QR code to your friends to invite them to use SkillBridge and also earn money.
am: SkillBridgeን እንዲጠቀሙ ለመጋበዝ እና ገንዘብ ለማግኘት ይህንን የQR ኮድ ለጓደኞችዎ ያካፍሉ።
or: Hiriyoota kee akka SkillBridge fayyadaman affeeruuf QR koodii kana qoodiitiiis qarshii argadhu.

source: Share
am: ያጋሩ
or: Qoodii

source: Copy
am: ቅዳ
or: Gulaalii

source: Total Referrals
am: ጠቅላላ ሪፈራሎች
or: Walitti makamiinsa waliigalaa

source: Invite
am: ይጋብዙ
or: Afeeraa

source: Refer
am: ያጋሩ
or: Fayyadamuu beeksisuu

source: Refer a Friend, Earn 10 Birr!
am: ለጓደኛ ያጋሩ ፣ 10 ብር ያግኙ!
or: Hiriyaa akeeksi, qarshii 10 argadhu!

# we_have_sent_a_verification_code_to_email
source: We have sent a verification code to your email
or: Koodii mirkaneessaa email keessaniif erginee jirra
